import { News } from '../store/news/types';

export const userLogin = 'User853';
export const userPassword = 'SimSim63?';
export const adminLogin = 'Admin378';
export const adminPassword = 'mars43Q!?';

export const mockNewsList: Array<News> = [
  {
    id: 'f9l5m2C2K5f3r8r3I7p5y7W8',
    date: '06-05-2022',
    title:
      'Бывшие сотрудники Mojang выступили против бездумного внедрения NFT в игры',
    body: 'Организация Climate Replay, основанная сотрудниками Mojang при поддержке Xbox Game Studios, представила руководство для разработчиков видеоигр относительно внедрения NFT в проекты. Компания призвала не гнаться за прибылью и добавлять в проекты только то, что приносит игрокам значимую пользу.',
    isApproved: true,
  },
  {
    id: 'E6o6f1v2P3F1W5u2u8j5q3A0',
    date: '05-05-2022',
    title: 'Китайская альтернатива Intel и AMD',
    body: '29 апреля этого года российский производитель средств вычислительной техники Группа Компаний ТОНК, представил два новых устройства - ноутбук и мини компьютер на китайском x86 процессоре.',
    isApproved: true,
  },
  {
    id: 'g8Q6o1M9l6i0w1u8o4p8p5t1',
    date: '05-05-2022',
    title: 'TeamViewer перестал работать в России и Беларуси',
    body: 'С 5 мая 2022 года в Беларуси и России перестал работать сервис TeamViewer. Теперь при попытке подключения к удаленному рабочему месту пользователь получает служебное сообщение:"Невозможно подключиться к партнеру." Еще 5 марта 2022 года, компания TeamViewer объявила о том, что не поддерживает агрессию России и Беларуси в отношении Украины и украинского народа и прекращает продажу новых лицензий на территории данных государств.',
    isApproved: true,
  },
  {
    id: 'e2p7o8y1R2k0k5V9e8r4y6p3',
    date: '05-05-2022',
    title: 'Илон Маск на время станет СЕО Twitter после закрытия сделки',
    body: 'Илон Маск может на время занять должность СЕО Twitter после приобретения компании. Нынешний генеральный директор Параг Агравал останется на своём посту до завершения продажи. Как сообщает CNBC со ссылкой на собственные источники, Маск будет руководить компанией несколько месяцев. О своих планах он сообщил новым инвесторам.',
    isApproved: true,
  },
  {
    id: 'q2k2e1o1C5y8c0u4s6m2m5w3',
    date: '05-05-2022',
    title:
      'Clarivate подтвердила, что доступ к Web of Science для российских учёных закрыт',
    body: 'Компания Clarivate, которая управляет базой данных научного цитирования Web of Science, подтвердила, что доступ к базе для российских учёных закрыт. Коммерческая деятельность компании в России приостановлена с 11 марта. «Мы приняли решение закрыть наш офис в России и прекратить коммерческую деятельность в России. Это означает, что действие учётных записей российских пользователи Web of Science приостановлено»,— сообщили в компании агентству ТАСС.',
    isApproved: true,
  },
];
